ronit991/TivaPeripheralDrivers/TM4C123xxGPIO_DRIVER.c
/******************************************************************************************************************
*	@file			-	TM4C123xxGPIO_DRIVER.c																																							*
*	@author		-	Ronit Vairagi																																												*
*																																																									*
*	This file contains the definitions of GPIO Driver APIs.																													*
*																																																									*
* @Note			-	All of the code present in the this file applies to TM4C123GH6PM microcontroller.										*
*																																																									*
*	@Note2		- Feel free to use, modify, and/or re-distribute this code at your will.															*
******************************************************************************************************************/



#include "TM4C123xxGPIO_DRIVER.h"



/******************************************************************************************************************
*																					User Switches and Onboard LEDs																					*
*	This information is valid for TM4C123GXL  board only.																														*
*		Pin:				PF0					PF1					PF2					PF3						PF4																							*
*		Function:		UserSw2			LedR				LedB				LedG					UserSw1																					*
******************************************************************************************************************/




/******************************************************************************************************************
*																						Functions for internal use																						*
*	Below are the definitions for functions which are meant to be used only by the GPIO Driver APIs.								*
*	Any use of these functions should be striclty avoided outside the scope of this driver as this may cause				*
*	serious problems within the microcontroller.																																		*
*	Uncomment the below defined functions when required.																														*
******************************************************************************************************************/

//static void GPIO_write_unlock(	GPIO_reg* pGPIO)
//{
//	pGPIO->GPIO_LOCK = 0x4C4F434B;
//	pGPIO->GPIO_CR |= 0x00000011;
//}

//static void GPIO_write_lock(	GPIO_reg* pGPIO)
//{
//	pGPIO->GPIO_LOCK = 0x00000000;
//	pGPIO->GPIO_CR &= 0x11111100;
//}



/******************************************************************************************************************
*																					APIs Supported by this Driver																						*
*		Below are the prototypes for driver APIs																																			*
*		Definitions for these can be found in TM4C123xxGPIO_DRIVER.c file																							*
*																																																									*
*	1. 	GPIO_ClockControl()		-		Enable/Disable clock for a GPIO port.																							*
*	2. 	GPIO_Init()						-		Initialize a GPIO pin. Use this function in your programs only if you	need a fine *
*																control over the drive strength of the pin.																				*
*																Otherwise use functions 4/5/6 for simplicity.																			*
*	3. 	GPIO_DeInit()					-		Reset and turn off a GPIO port.																										*
*	4. 	DigitalPin()					-		Initialize a GPIO pin in Digital mode with 8mA drive strength.										*
*	5. 	AnalogPin()						-		Initialize a GPIO pin in Analog	mode with 8mA drive strength.											*
*	6. 	InterruptPin()				-		Initialize a GPIO pin in Digital(input) mode with interrupt reception.						*
*	7. 	WriteToPin()					-		Write digital values to a GPIO pin																								*
*	8. 	WriteToPort()					-		Write digital values to a GPIO port																								*
*	9. 	ToggleGPIOPin()				-		Toggle the state of a GPIO pin																										*
*	10. ReadFromPin()					-		Read data from a GPIO pin																													*
*	11. ReadFromPort()				-		Read data from a GPIO port																												*
******************************************************************************************************************/



/******************************************************************************************************************
*	@GPIO_ClockControl																																															*
* @brief			-	This function is used to enable or disable clock for a particular GPIO port												*
*	@GPIOPort		- Name of the GPIO port for which clock needs to be enabled or disabled.														*
*	@ClkEn			- This variable speifies whether we have to enable or disable the clock.														*
*								Use (I) ENABLE or (II) DISABLE macros for this variable for better readability.										*
*								These macros are defined in TM4C123xx.h header file under the section "Miscellaneous macros and		*
*								shorthands".																																											*
* @return			-	Nothing (void).																																										*
*																																																									*
*	@Note				-	Refer to section Pg 340 of datasheet for detailed information.																		*
******************************************************************************************************************/
void	GPIO_ClockControl(uint8_t GPIOPort, uint8_t ClkEn)
{
	if(ClkEn == ENABLE)
	{
		switch(GPIOPort)												// Enable the clock for the port.
		{
			case GPIO_PORT_A:		GPIOA_PCLK_EN();				break;	// These macros are defined in TM4C123xx.h file in section 2.2
			case GPIO_PORT_B:		GPIOB_PCLK_EN(); 				break;
			case GPIO_PORT_C:		GPIOC_PCLK_EN(); 				break;
			case GPIO_PORT_D:		GPIOD_PCLK_EN(); 				break;
			case GPIO_PORT_E:		GPIOE_PCLK_EN(); 				break;
			case GPIO_PORT_F:		GPIOF_PCLK_EN(); 				break;
		}
	}
	else if(ClkEn == DISABLE)
	{
		switch(GPIOPort)												// Disable the clock.
		{
			case GPIO_PORT_A:		GPIOA_PCLK_DIS(); 			break;	// These macros are defined in TM4C123xx.h file in section 2.2
			case GPIO_PORT_B:		GPIOB_PCLK_DIS(); 			break;
			case GPIO_PORT_C:		GPIOC_PCLK_DIS(); 			break;
			case GPIO_PORT_D:		GPIOD_PCLK_DIS(); 			break;
			case GPIO_PORT_E:		GPIOE_PCLK_DIS(); 			break;
			case GPIO_PORT_F:		GPIOF_PCLK_DIS(); 			break;
		}
	}
}
	
	

/******************************************************************************************************************
*	@GPIO_Init																																																			*
*	@brief					- This function is used to Initialize/Configure a GPIO Pin.																			*
*	@pin						-	Pin Number.																																										*
*	@ioMode					-	Direction (In/Out), and Pin Type (Pull Up, Pull Down, Open Drain).														*
*	@AltFn					-	Alternate Function Number.																																		*
*	@pinMode				-	Pin Mode ( Analog / Digital ).																																*
*	@DriveStrength	- Drive Strength ( 2mA, 4mA, 8mA ).																															*
* @Trigger				-	Interrupt Trigger Mode ( Rising/Falling/Both Edge trigger or High/Low Level trigger ).				*
* @return					-	Nothing (void).																																								*
*																																																									*
*	@Note						-	Steps to configure a GPIO pin:																																*
*										1. Provide clock to the GPIO port.																														*
*										2. Set the direction for the GPIO pin.																												*
*										3. Configure Alternate function.																															*
*										4. Configure Drive strength.																																	*
*										5. Configure output type of the pin ( Pull Up/Down or Open Drain).														*
*												5.1 (Optional) Configure slew rate for the pin.																						*
*										6. Configure pin mode (Analog / Digital).																											*
*										7. Configure type, event, and mask for interrupt.																							*
* 									Refer to section 10.3(Pg 656) of datasheet for detailed information on all these steps.				*
******************************************************************************************************************/
void	GPIO_Init(uint8_t pin, uint8_t ioMode, uint8_t pinMode, uint8_t DriveStrength, uint8_t Trigger)
{
	GPIO_reg* pGPIO =		getPortAddr(pin,APB_BUS);		//	Pointer to the GPIO port.
	uint8_t GPIO_Port = getPortName(pin);						//	Name of the GPIO port.
	uint8_t PinNumber = getPinNumber(pin);					//	Pin number which needs to be initialized.
	
	//	Step1:	Enable Clock.
	GPIO_ClockControl(GPIO_Port, ENABLE);
	
	//	Step2,5:	Set pin direction, and mode by setting/clearing appropriate bits in the GPIODIR and GPIO(PUR/PDR/ODR) registers.
	switch(ioMode)
	{
		case OutputOpenDrain:			pGPIO->GPIO_ODR	SET_BIT( PinNumber );
															pGPIO->GPIO_DIR SET_BIT( PinNumber );
															break;
		case Output:							pGPIO->GPIO_ODR	CLR_BIT( PinNumber );
															pGPIO->GPIO_DIR SET_BIT( PinNumber );
															break; 
		case InputPullUp:					pGPIO->GPIO_PUR	SET_BIT( PinNumber );
															pGPIO->GPIO_DIR CLR_BIT(PinNumber);
															break;
		case InputPullDown:				pGPIO->GPIO_PDR	SET_BIT( PinNumber );
															pGPIO->GPIO_DIR CLR_BIT(PinNumber);
															break;
		case Input:								pGPIO->GPIO_PUR	CLR_BIT( PinNumber );
															pGPIO->GPIO_PDR	CLR_BIT( PinNumber );
															pGPIO->GPIO_DIR CLR_BIT(PinNumber);
															break;
	}
	
	
