ronit991/TivaPeripheralDrivers/TM4C123xxGPIO_DRIVER.c
	/****************************************************************************************************************
	*	Step3:	Configure Alternate function.																																					*
	*	Alternate function is not configured here as it is done by the Driver APIs of the respective peripherals.			*
	****************************************************************************************************************/
	
	
	/****************************************************************************************************************
	*	Step 4:	Configure drive strength.																																							*
	*					Set the drive strength for each of the pins by setting the appropriate bits in the GPIODR2R, GPIODR4R	*
	*					and GPIODR8R registers.																																								*
	****************************************************************************************************************/
	switch(DriveStrength)
	{
		case Two_mA		:		pGPIO->GPIO_DR2R SET_BIT( PinNumber );		break;
		case Four_mA	:		pGPIO->GPIO_DR4R SET_BIT( PinNumber );		break;
		case Eight_mA	:		pGPIO->GPIO_DR8R SET_BIT( PinNumber );		break;
	}

	
	/****************************************************************************************************************
	*	Step 6:	Configure Pin Mode (Analog/Digital)																																		*
	*					Set the appropriate bit in GPIO(DEN/AMSEL) registers to enable digital/analog function for the pin.		*
	****************************************************************************************************************/
	switch(pinMode)
	{
		case Digital:			pGPIO->GPIO_DEN		SET_BIT( PinNumber );		break;
		case Analog	:			pGPIO->GPIO_AMSEL	SET_BIT( PinNumber );		break;
	}
	
	/****************************************************************************************************************
	*	Step7:	Configure Type, Event, and Mask for Interrupts																												*
	*																																																								*
	*	To prevent false interrupts, following steps should be taken when re-configuring GPIO Edge and Interrupt			*
	*	 sense registers:-																																														*
	*		1	Mask the corresponding port by clearing the IME field in the GPIOIM register.															*
	*				1.1	Masking the interrupt disallows the interrupt to be sent to the interrupt controller.								*
	*						Mask => Set the bit.	Unmask => Clear the bit.																											*
	*		2 Configure the IS and IBE field in the GPIOIS and GPIOIBE registers.																				*
	*				2.1	Interrupt Sense (IS)																																								*
	*						Level detection if the bit is Set.																																	*
	*						Edge	detection if the bit is Cleared.																															*
	*				2.2 Interrupt Both Edges (IBE)																																					*
	*						If bit is Set			:	Interrupt is detected on both rising and falling edges.													*
	*						If bit is Cleared	:	Interrupt is controlled by GPIOIEV register.																		*
	*						__this however, works only if IS register is configured to detect edges__														*
	*		3	Configure Interrupt Event Register in case of single-edge or level triggered interrupt.										*
	*				Bit = 1		:	Rising  Edge / High Level																																		*
	*				Bit = 0		: Falling Edge / Low  Level																																		*
	*		4	Clear the GPIORIS register.																																								*
	*				4.1	GPIORIS is a Read-Only type register.																																*
	*						If a bit is Set		:	It suggests that an Interrupt has occurred on the corresponding pin.						*
	*						If a bit is Reset	:	It suggests that no interrupt has occurred on the corresponding pin.						*
	*				4.2	Clearing the Register																																								*
	*						For a level detected interrupt, the corresponding bit in this register is automatically cleared			*
	*						when the interrupt has been serviced.																																*
	*						For a edge detected interrupt, the bit is cleared by writing a '1' in the corresponding bit in			*
	*						the GPIOICR register. Writing a '0' to any of the bits has no effect. Also, level triggered					*
	*						interrupts are not affected by writing '1' to this register.																				*
	*		5	Unmask the port by setting the IME field in the GPIOIM register.																					*
	****************************************************************************************************************/
	if(Trigger == NoInterrupt)
	{ // do nothing
	}
	else
	{
		uint8_t clearICR = 0;											// Flag to clear ICR register for Edge-triggered interrupts.
		pGPIO->GPIO_IM CLR_BIT( PinNumber );			// Mask the interrupt so that it doesn't cause any unwanted event while configuring the interrupt registers.
		switch(Trigger)
		{
			case RisingEdge:	pGPIO->GPIO_IS		CLR_BIT( PinNumber );
												pGPIO->GPIO_IBE 	CLR_BIT( PinNumber );
												pGPIO->GPIO_IEV 	SET_BIT( PinNumber );
												clearICR = 1;
												break;
			
			case FallingEdge:	pGPIO->GPIO_IS		CLR_BIT( PinNumber );
												pGPIO->GPIO_IBE 	CLR_BIT( PinNumber );
												pGPIO->GPIO_IEV 	CLR_BIT( PinNumber );
												clearICR = 1;
												break;
			
			case BothEdges:		pGPIO->GPIO_IS		CLR_BIT( PinNumber );
												pGPIO->GPIO_IBE 	SET_BIT( PinNumber );
												clearICR = 1;
												break;
												
			case HighLevel:		pGPIO->GPIO_IS		SET_BIT( PinNumber );
												pGPIO->GPIO_IBE		CLR_BIT( PinNumber );
												pGPIO->GPIO_IEV		SET_BIT( PinNumber );
												break;
			
			case LowLevel:		pGPIO->GPIO_IS		SET_BIT( PinNumber );
												pGPIO->GPIO_IBE 	CLR_BIT( PinNumber );
												pGPIO->GPIO_IEV 	CLR_BIT( PinNumber );
												break;
		}
		if(clearICR)
			pGPIO->GPIO_ICR SET_BIT( PinNumber );		//	Clear ICR register for Edge-triggered interrupts.
		
		pGPIO->GPIO_IM SET_BIT( PinNumber );			//	Disable the interrupt mask to re-enable the interrupts.
	}
}



/******************************************************************************************************************
*	@GPIO_DeInit()																																																	*
*	@brief				-	This function DeInitializes or Resets a GPIO port																								*
* @GPIO_PORT		-	This is the name of the GPIO Port which needs to be reset.																			*
* @return				-	Nothing (void).																																									*
*																																																									*
*	@Note					- To reset a GPIO port, the corresponding bit in the SRGPIO register needs to be set. Clock to		*
*									the port is then disabled to save power, and prevent access to the port.												*
******************************************************************************************************************/
void	GPIO_DeInit(uint8_t GPIOPort)
{
	SYSCTL->SRGPIO	SET_BIT( GPIOPort );				// Reset the port by setting the appropriate bit in SRGPIO register.
	SYSCTL->SRGPIO	CLR_BIT( GPIOPort );				// The bit is cleared so that it doesn't always remain in reset state.
	
	GPIO_ClockControl(GPIOPort,DISABLE);				// Disable the clock.
}
	
	

/******************************************************************************************************************
*	@ReadFromPin()																																																	*
*	@brief				-	This function reads data from a GPIO pin																												*
* @pin					-	This is the pin from which we have to read the data																							*
* @return				-	Digital value on the specified pin.																															*
******************************************************************************************************************/
uint8_t	ReadFromPin(uint8_t pin)
{
	GPIO_reg* pGPIOx = getPortAddr(pin, APB_BUS);
	return GET_BIT( pGPIOx->GPIO_DATA, getPinNumber(pin) );
//	The above statement is equivalent to return ( pGPIO->GPIO_DATA & (1<<PinNumber) )
}
	

	
/******************************************************************************************************************
*	@ReadFromPort()																																																	*
*	@brief				-	This function reads data from a GPIO port																												*
* @GPIOPort			-	This is the GPIO Port from which we have to read the data.																			*
* @return				-	Digital values on all of the pins of the specified port.																				*
******************************************************************************************************************/
uint8_t	ReadFromPort(uint8_t GPIOPort)
{
	GPIO_reg* pGPIO = getPortAddr(GPIOPort, APB_BUS);
	return (uint8_t)( pGPIO->GPIO_DATA );
}
	
	

/******************************************************************************************************************
*	@WriteToPin()																																																		*
*	@brief				-	This function writes the given value to a GPIO pin																							*
* @pin					-	This is the pin to which we have to write the data																							*
*	@Value				-	Value which is to be written to the pin.																												*
* @return				-	Nothing (void).																																									*
******************************************************************************************************************/
void WriteToPin(uint8_t pin, uint8_t Value)
{
	GPIO_reg* pGPIO = getPortAddr(pin, APB_BUS);
	if(Value == PIN_SET)					pGPIO->GPIO_DATA SET_BIT( getPinNumber(pin) );
	else if(Value == PIN_RESET)		pGPIO->GPIO_DATA CLR_BIT( getPinNumber(pin) );
	
	//	The above statement is equivalent to the following:-
	//	if(Value == PIN_SET)					pGPIO->GPIO_DATA |=	(1<<PinNumber);
	//	else if(Value == PIN_RESET)		pGPIO->GPIO_DATA &= ~(1<<PinNumber);
}
	


/******************************************************************************************************************
*	@WriteToPort()																																																	*
*	@brief				-	This function writes the given data to a GPIO port																							*
* @GPIO_PORT		-	This is the GPIO Port to which we have to write the data.																				*
*	@Values				-	Values which is to be written to the port.																											*
* @return				-	Nothing (void).																																									*
******************************************************************************************************************/
void WriteToPort(uint8_t GPIO_PORT, uint8_t Values)
{
	GPIO_reg* pGPIO = getPortAddr(GPIO_PORT, APB_BUS);
	pGPIO->GPIO_DATA = Values;
}
	
	

/******************************************************************************************************************
*	@ToggleGPIOPin()																																																*
*	@brief				-	This function toggles the state of a GPIO pin																										*
* @pin					-	This is the pin which needs to be toggled.																											*
* @return				-	Nothing (void).																																									*
******************************************************************************************************************/
void ToggleGPIOPin(uint8_t pin)
{
	getPortAddr(pin,APB_BUS)->GPIO_DATA ^= (1<<getPinNumber(pin));
	//	The above statement is equivalent to pGPIOx->GPIO_DATA ^= (1<<PinNumber)
	//	Remember x^1 = x'
}



/******************************************************************************************************************
*	@DigitalPin()																																																		*
*	@brief				-	This function configures a GPIO pin in Digital mode																							*
* @pin					-	This variable holds the pin number which needs to be configured.																*
*	@IOmode				-	Input/Output mode.																																							*
* @return				-	Nothing (void).																																									*
******************************************************************************************************************/
void DigitalPin(uint8_t pin, uint8_t IOmode)
{
	GPIO_Init(pin, IOmode, Digital, Two_mA, NoInterrupt);
}



/******************************************************************************************************************
*	@AnalogPin()																																																		*
*	@brief				-	This function configures a GPIO pin in Analog mode																							*
* @pin					-	This variable holds the pin number which needs to be configured.																*
*	@IOmode				-	Input/Output mode.																																							*
* @return				-	Nothing (void).																																									*
******************************************************************************************************************/
void	AnalogPin(uint8_t pin, uint8_t IOmode)
{
	GPIO_Init(pin, IOmode, Analog, Two_mA, NoInterrupt);
}



/******************************************************************************************************************
*	@InterruptPin()																																																	*
*	@brief				-	This function configures a GPIO pin as an Interrupt pin																					*
* @pin					-	This variable holds the pin number which needs to be configured.																*
*	@triggerMode	-	Interrupt Trigger Mode ( Rising/Falling/Both Edge trigger or High/Low Level trigger )						*
* @return				-	Nothing (void).																																									*
******************************************************************************************************************/
void	InterruptPin(uint8_t pin, uint8_t triggerMode)
{
	uint8_t PortName = getPortName(pin);
	uint8_t PinNumber = getPinNumber(pin);
	
	// Initialize the given pin with the specified interrupt trigger mode.
	GPIO_Init(pin, Input, Digital, Eight_mA, triggerMode);
	
